;************************************************************************************************************
;XComGame.int - This File manages the text descriptions for my custom Perks, Classes & Class Nicknames
;Perks are organized A-Z with the Exception of GTS Perks which are in their own Section organized A-Z by Class
;Class Names, Descriptions & Nicknames are at the very bottom of this file
;Recommend Press CTRL + F and Type in what you are looking for
;************************************************************************************************************


;************************************************************************************************************
;Custom Perks A-Z (Except GTS)
;************************************************************************************************************

[ActionProtocolRS X2AbilityTemplate]
LocFriendlyName="Action Protocol"
LocLongDescription="Send the GREMLIN to resupply a target ally, granting them +1 Action Point."
LocHelpText="Send the GREMLIN to resupply a target ally, granting them +1 Action Point."
LocFlyOverText="Action Protocol"
LocPromotionPopupText="<Bullet/> Action Protocol has <Ability:ACTIONPROTOCOLRS_CHARGES/> Charges per Mission.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/>"

[AegisRS X2AbilityTemplate]
LocFriendlyName="Aegis"
LocLongDescription="Confers Fortress & Sustain."
LocHelpText="Confers Fortress & Sustain."
LocFlyOverText="Aegis"
LocPromotionPopupText="<Bullet/> Fortress grants immunity to elemental effects & explosive damage.<br/><Bullet/> Sustain allows the user to cheat death once per mission.<br/>"

[AimAssistRS X2AbilityTemplate]
LocFriendlyName="Aim Assist"
LocLongDescription="Send the GREMLIN to give a target ally an aerial view of the battlefied, granting them +<Ability:AIMASSISTRS_AIMBONUS/> Aim and Squadsight."
LocHelpText="Send the GREMLIN to give a target ally an aerial view of the battlefied, granting them +<Ability:AIMASSISTRS_AIMBONUS/> Aim and Squadsight."
LocFlyOverText="Aim Assist"
LocPromotionPopupText="<Bullet/> Aim Assist grants +<Ability:AIMASSISTRS_AIMBONUS/> Aim and Squadsight.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/>"

[BarrierRS X2AbilityTemplate]
LocFriendlyName="Barrier"
LocLongDescription="Create a Psionic Energy Shield around nearby allies."
LocHelpText="Create a Psionic Energy Shield around nearby allies."
LocFlyOverText="Barrier"
LocPromotionPopupText="<Bullet/> Psionic Barrier confers <Ability:BARRIERRS_HEALTH/> Shield Points to each ally.<br/><Bullet/> Barrier lasts <Ability:BARRIERRS_DURATION/> turns.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[BladefighterRS X2AbilityTemplate]
LocFriendlyName="Bladefighter"
LocLongDescription="Grants +<Ability:BLADEFIGHTERRS_AIM/> aim and +<Ability:BLADEFIGHTERRS_CRIT/> critical chance on all Melee Attacks."
LocHelpText="Grants +<Ability:BLADEFIGHTERRS_AIM/> aim and +<Ability:BLADEFIGHTERRS_CRIT/> critical chance on all Melee Attacks."
LocFlyOverText="Bladefighter"
LocPromotionPopupText="<Bullet/> Grants +<Ability:BLADEFIGHTERRS_AIM/> aim and +<Ability:BLADEFIGHTERRS_CRIT/> critical chance on all Melee Attacks.<br/><Bullet/> This is a passive effect.<br/>"

[BlitzRS X2AbilityTemplate]
LocFriendlyName="Blitz!"
LocLongDescription="Throw caution to the wind and dash up to an enemy to attack them close range with your sidearm."
LocHelpText="Throw caution to the wind and dash up to an enemy to attack them close range with your sidearm."
LocFlyOverText="Blitz!"
LocPromotionPopupText="<Bullet/> Has a +<Ability:BLITZRS_CRIT/> Critical Chance.<br/><Bullet/> Replaces the Charge! ability.<br/>"

[BoonRS X2AbilityTemplate]
LocFriendlyName="Boon"
LocLongDescription="Confers Restore & Solace."
LocHelpText="Confers Restore & Solace."
LocFlyOverText="Boon"
LocPromotionPopupText="<Bullet/> Restore allows the user to heal a target ally & cleanse them of negative effects.<br/><Bullet/> Solace is a passive effect that allows the user to cleanse nearby allies of mental effects.<br/>"

[BreachingRoundRS X2AbilityTemplate]
LocFriendlyName="Breaching Round"
LocLongDescription="A <Ability:WEAPONNAME/> shot that doesn't deal any damage but is likely to destroy an enemies cover."
LocHelpText="A <Ability:WEAPONNAME/> shot that doesn't deal any damage but is likely to destroy an enemies cover."
LocFlyOverText="Breaching Round"
LocPromotionPopupText="<Bullet/> Chance to destroy cover is based on weapon tech level.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[BulletSwarmRS X2AbilityTemplate]
LocFriendlyName="Bulletswarm"
LocLongDescription="Allows this unit to take standard shots at the cost of 1 action point."
LocHelpText="Fire a shot at a target. Costs 1 Action Point."
LocFlyOverText="Bulletswarm"
LocPromotionPopupText="<Bullet/>Standard shots will cost 1 action to fire, allowing additional shots to be taken based on the users remaining action points.<br/><Bullet/> By default the user may be able to shoot and move or shoot twice without moving per turn.<br/>"

[BurnProtocolRS X2AbilityTemplate]
LocFriendlyName="Burn Protocol"
LocLongDescription="Send the GREMLIN to deploy a phosphorus material over a target enemy, dealing GREMLIN damage and burning the target."
LocHelpText="Send the GREMLIN to deploy a phosphorus material over a target enemy, dealing GREMLIN damage and burning the target."
LocFlyOverText="Burn Protocol"
LocPromotionPopupText="<Bullet/> Initial damage dealt is equal to GREMLIN Tech Level.<br/><Bullet/> Burn damage dealt is equal to <Ability:BURNPROTOCOLRS_DAMAGEPERTICK/> damage per turn until the effect wears off.<br/><Bullet/> Burn Protocol has <Ability:BURNPROTOCOLRS_CHARGES/> Charges per Mission.<br/>"

[CapacitorDischargeRS X2AbilityTemplate]
LocFriendlyName="Capacitor Discharge"
LocLongDescription="Send the GREMLIN to a location where it emits a substantial electric discharge, damaging and potentially stunning all nearby units. Robotic units take more damage."
LocHelpText="Send the GREMLIN to electrocute all units in a radius. Robotic units take more damage."
LocFlyOverText="Capacitor Discharge"
LocPromotionPopupText="<Bullet/> Capacitor Discharge has <Ability:CAPACITORDISCHARGERS_CHARGES/> charges per mission.<br/><Bullet/> Capacitor Discharge will deal more damage as you upgrade your GREMLIN.<br/>"

[ChargeRS X2AbilityTemplate]
LocFriendlyName="Charge!"
LocLongDescription="Dash up to an enemy to attack them close range with your sidearm."
LocHelpText="Dash up to an enemy to attack them close range with your sidearm."
LocFlyOverText="Charge!"
LocPromotionPopupText="<Bullet/> Charge attacks can be risky, especially when they miss or fail to kill the target.<br/><Bullet/> As such they should be used with caution.<br/>"

[ClutchShotRS X2AbilityTemplate]
LocFriendlyName="Clutch Shot"
LocLongDescription="A skilled shot with your Pistol that cannot miss."
LocHelpText="A skilled shot with your Pistol that cannot miss."
LocFlyOverText="Clutch Shot"
LocPromotionPopupText="<Bullet/> Clutch shot confers enough of an aim bonus that the aim chance shouldn't ever be less than 100%.<br/><Bullet/> Clutch shots can graze enemies.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[CombatProtocolRS X2AbilityTemplate]
LocFriendlyName="Combat Protocol"
LocLongDescription="Send the GREMLIN to an enemy to jolt them, dealing guaranteed damage, which is increased against robotic enemies."
LocHelpText="Send the GREMLIN to an enemy to jolt them, dealing guaranteed damage, which is increased against robotic enemies. Requires line of sight to the target."
LocFlyOverText="Combat Protocol"
LocPromotionPopupText="<Bullet/> Combat Protocol has <Ability:COMBATPROTOCOLRS_CHARGES/> charges per mission.<br/><Bullet/> Upgrading your GREMLIN will lead to more damage per charge.<br/>"

[ConcealandCarryRS X2AbilityTemplate]
LocFriendlyName="Conceal and Carry"
LocLongDescription="Special training that allows this soldier to stay in concealment when the squad is revealed and better evade enemy detection."
LocHelpText="Special training that allows this soldier to stay in concealment when the squad is revealed and better evade enemy detection."
LocFlyOverText="Conceal and Carry"
LocPromotionPopupText="<Bullet/> This soldier won't break concealment when the squad is revealed and will be concealed on missions when the rest of the squad isn't.<br/><Bullet/> The soldier is also harder to detect while concealed with a -40% Detection Radius.<br/><Bullet/> Grants a single charge of the conceal ability per mission, allowing the soldier to return to concealment when in cover and not flanked or when not in an enemies line of sight.<br/><Bullet/> This is a passive effect.<br/>"	

[ControllerRS X2AbilityTemplate]
LocFriendlyName="Controller"
LocLongDescription="Confers Insanity & Domination."
LocHelpText="Confers Insanity & Domination."
LocFlyOverText="Controller"
LocPromotionPopupText="<Bullet/> Insanity allows the user to try and inflict negative mental effects, including mind control on an enemy.<br/><Bullet/> Domination : make mind - controller!!!<br/>"

[DeathMarkRS X2AbilityTemplate]
LocFriendlyName="Death Mark"
LocLongDescription="Marks an enemy target, graning allies +<Ability:DEATHMARKRS_CRIT/> Critical Chance against them."
LocHelpText="Marks an enemy target, graning allies +<Ability:DEATHMARKRS_CRIT/> Critical Chance against them."
LocFlyOverText="Death Mark"
LocPromotionPopupText="<Bullet/> An enemy can only be marked by one 'mark' effect at a time.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"	

[DisableRS X2AbilityTemplate]
LocFriendlyName="Disable"
LocLongDescription="Disable enemy weapons within a large area of effect, forcing them to reload to be able to fire again."
LocHelpText="Disable enemy weapons within a large area of effect, forcing them to reload to be able to fire again."
LocFlyOverText="Disable"
LocPromotionPopupText="<Bullet/> Carries a <Ability:DISABLERS_STUNCHANCE/>% chance to stun enemies within the AoE.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[DistortionFieldRS X2AbilityTemplate]
LocFriendlyName="Distortion Field"
LocLongDescription="The Technician emits a field that distrots enemy targeting slightly, providing a +<Ability:DISTORTIONFIELDRS_DEFENSE/> Defense Bonus to the Entire Squad."
LocHelpText="The Technician emits a field that distrots enemy targeting slightly, providing a +<Ability:DISTORTIONFIELDRS_DEFENSE/> Defense Bonus to the Entire Squad."
LocFlyOverText="Distortion Field"
LocPromotionPopupText="<Bullet/> This effect is only active when a Technician with this ability is deployed on a mission.<br/><Bullet/> The effect remains active even if the Technician evacs or dies in combat.<br/><Bullet/> This is a passive effect.<br/>"

[ExplosiveShotRS X2AbilityTemplate]
LocFriendlyName="Explosive Shot"
LocLongDescription="A <Ability:WEAPONNAME/> shot that deals double damage and ruptures a target, making them take +<Ability:EXPLOSIVESHOTRS_RUPTURE/> damage from all future attacks."
LocHelpText="A <Ability:WEAPONNAME/> shot that deals double damage and ruptures a target, making them take +<Ability:EXPLOSIVESHOTRS_RUPTURE/> damage from all future attacks. Costs <Ability:SELFAMMOCOST/> ammo and has a <Ability:SELFCOOLDOWN/> turn cooldown."
LocFlyOverText="Explosive Shot"
LocPromotionPopupText="<Bullet/> Ruptured targets will take more damage from additional attacks so it's best to use a rupture effect attack first.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[ExtraConditioningRS X2AbilityTemplate]
LocFriendlyName="Run And Gun (Extra Conditioning)"
LocLongDescription="Take an action after dashing. Has a lower cooldown than standard Run And Gun."
LocHelpText="Take an action after dashing."
LocFlyOverText="Run And Gun (Extra Conditioning)"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Replaces the Run And Gun ability.<br/>"

[ExtraLayersRS X2AbilityTemplate]
LocFriendlyName="Extra Layers"
LocLongDescription="Extra Layers provide the soldier with +<Ability:EXTRALAYERSRS_ARMOR/> Armor Points."
LocHelpText="Extra Layers provide the soldier with +<Ability:EXTRALAYERSRS_ARMOR/> Armor Points."
LocFlyOverText="Extra Layers"
LocPromotionPopupText="<Bullet/> Grants +<Ability:EXTRALAYERSRS_ARMOR/> Armor Points.<br/><Bullet/> This is a passive effect.<br/>"

[ExtraSuppliesRS X2AbilityTemplate]
LocFriendlyName="Extra Supplies"
LocLongDescription="Carry <Ability:EXTRADARTSRS_CHARGES/> extra Healing Darts per mission."
LocHelpText="Carry <Ability:EXTRADARTSRS_CHARGES/> extra Healing Darts per mission."
LocFlyOverText="Extra Supplies"
LocPromotionPopupText="<Bullet/> Grants <Ability:EXTRADARTSRS_CHARGES/> extra Healing Darts per mission.<br/><Bullet/> This is a passive effect.<br/>"

[FireAtWillRS X2AbilityTemplate]
LocFriendlyName="Fire at Will"
LocLongDescription="When in Overwatch this soldier can take as many reaction shots as they have ammo for."
LocHelpText="When in Overwatch this soldier can take as many reaction shots as they have ammo for."
LocFlyOverText="Fire at Will"
LocPromotionPopupText="<Bullet/> This form of overwatch will last until the soldier runs out of ammo or there are no more available targets.<br/><Bullet/> This is a passive effect.<br/>"

[FieldMedicRS X2AbilityTemplate]
LocFriendlyName="Field Medic"
LocLongDescription="Equipped medikits gain <Ability:FIELDMEDICRS_MEDIKITCHARGES/> extra charges."
LocHelpText="Equipped medikits gain <Ability:FIELDMEDICRS_MEDIKITCHARGES/> extra charges."
LocFlyOverText="Field Medic"
LocPromotionPopupText="<Bullet/> Equipped medikits gain <Ability:FIELDMEDICRS_MEDIKITCHARGES/> extra charges.<br/><Bullet/> This is a passive effect.<br/>"	

[FirstAiderRS X2AbilityTemplate]
LocFriendlyName="First Aider"
LocLongDescription="Equipped medikits gain <Ability:FIRSTAIDERRS_MEDIKITCHARGES/> extra charges."
LocHelpText="Equipped medikits gain <Ability:FIRSTAIDERRS_MEDIKITCHARGES/> extra charges."
LocFlyOverText="First Aider"
LocPromotionPopupText="<Bullet/> Equipped medikits gain <Ability:FIRSTAIDERRS_MEDIKITCHARGES/> extra charges.<br/><Bullet/> This is a passive effect.<br/>"	

[FlashFireRS X2AbilityTemplate]
LocFriendlyName="Flash Fire"
LocLongDescription="Take a free shot with your pistol followed up by another shot from either of your weapons, each shot carries a <Ability:FLASHFIRERS_AIM_PENALTY/> Aim Penalty."
LocHelpText="Take a free shot with your pistol followed up by another shot from either of your weapons, each shot carries a <Ability:FLASHFIRERS_AIM_PENALTY/> Aim Penalty."
LocFlyOverText="Flash Fire"
LocPromotionPopupText="<Bullet/> Each shot carries a <Ability:FLASHFIRERS_AIM_PENALTY/> Aim Penalty.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[FlashRoundRS X2AbilityTemplate]
LocFriendlyName="Flash Round"
LocLongDescription="A <Ability:WEAPONNAME/> shot that doesn't deal any damage but disorients a target."
LocHelpText="A <Ability:WEAPONNAME/> shot that doesn't deal any damage but disorients a target."
LocFlyOverText="Flash Round"
LocPromotionPopupText="<Bullet/> The chance to Disorient is based on the aim chance of the shot.<br/><Bullet/> Has a +<Ability:FLASHROUNDRS_AIMBONUS/> Aim Bonus.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[FlechetteShotRS X2AbilityTemplate]
LocFriendlyName="Flechette Shot"
LocLongDescription="A wide <Ability:WEAPONNAME/> shot that is more accurate than a standard shot and has a larger spread but deals reduced damage."
LocHelpText="A wide <Ability:WEAPONNAME/> shot that is more accurate than a standard shot and has a larger spread but deals reduced damage. Costs <Ability:SELFAMMOCOST/> ammo and has a <Ability:SELFCOOLDOWN/> turn cooldown."
LocFlyOverText="Flechette Shot"
LocPromotionPopupText="<Bullet/> Flechette shot can hit multiple enemies in a cone of fire.<br/><Bullet/> The shot has a built in aim bonus, +15 by default.<br/><Bullet/> The shot has a built in damage reduction, -3 by default.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[FortitudeRS X2AbilityTemplate]
LocFriendlyName="Fortitude"
LocLongDescription="Grants +<Ability:FORTITUDERS_DEFENSE/> Defense."
LocHelpText="Grants +<Ability:FORTITUDERS_DEFENSE/> Defense."
LocFlyOverText="Fortitude"
LocPromotionPopupText="<Bullet/> Grants +<Ability:FORTITUDERS_DEFENSE/> Defense.<br/><Bullet/> This is a passive effect.<br/>"

[GatlingFireRS X2AbilityTemplate]
LocFriendlyName="Gatling Fire"
LocLongDescription="Unleash a volley of 3 <Ability:WEAPONNAME/> shots at a single enemy but each shot carries a <Ability:GATLINGFIRERS_AIMPENALTY/> Aim Penalty."
LocHelpText="Unleash a volley of 3 <Ability:WEAPONNAME/> shots at a single enemy but each shot carries a <Ability:GATLINGFIRERS_AIMPENALTY/> Aim Penalty."
LocFlyOverText="Gatling Fire"
LocPromotionPopupText="<Bullet/> Each shot carries a <Ability:GATLINGFIRERS_AIMPENALTY/> Aim Penalty.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[HealRS X2AbilityTemplate]
LocFriendlyName="Heal"
LocLongDescription="Restore a small amount of health to a nearby ally and cure them of any environmental ailments."
LocHelpText="Restore a small amount of health to a nearby ally and cure them of any environmental ailments."
LocFlyOverText="Heal"
LocPromotionPopupText="<Bullet/> Restores 4 Health but this increases to 6 with Nanomedikits Tech.<br/><Bullet/> Must target an organic ally within 2 tiles of the user, cannot target self.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Removes Effects such as Burning, Poison and Acid Burn.<br/>"

[HealingDartsRS X2AbilityTemplate]
LocFriendlyName="Healing Darts"
LocLongDescription="Fire medicinal darts at an organic ally to heal them from range."
LocHelpText="Fire medicinal darts at an organic ally."
LocFlyOverText="Healing Darts"
LocPromotionPopupText="<Bullet/> Restores 4 Health but this increases to 6 with Nanomedikits Tech.<br/><Bullet/> Does not cost ammo to fire and the sight range is quite lenient.<br/><Bullet/> Has <Ability:HEALINGDARTSRS_CHARGES/> uses per Mission.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/>"

[HideRS X2AbilityTemplate]
LocFriendlyName="Hide"
LocLongDescription="Allows the soldier to re-enter concealment at any time."
LocHelpText="Re-enter concealment."
LocFlyOverText="Hide"
LocPromotionPopupText="<Bullet/> Can only be used when in cover and not flanked or when out of an enemies line of sight.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"	

[HipFireRS X2AbilityTemplate]
LocFriendlyName="Hip Fire"
LocLongDescription="Take a free shot with your <Ability:WEAPONNAME/> but at a <Ability:HIPFIRERS_PENALTY/> Aim Penalty."
LocHelpText="Take a free shot with your <Ability:WEAPONNAME/> but at a <Ability:HIPFIRERS_PENALTY/> Aim Penalty."
LocFlyOverText="Hip Fire"
LocPromotionPopupText="<Bullet/> Has a <Ability:HIPFIRERS_PENALTY/> Aim Penalty.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"	

[KillCamRS X2AbilityTemplate]
LocFriendlyName="Kill Cam"
LocLongDescription="Send the GREMLIN to give a target ally a closer view of enemies on the battlefield, granting them +<Ability:KILLCAMRS_CRITBONUS/> Critical Chance and +<Ability:KILLCAMRS_DODGEBONUS/> Dodge."
LocHelpText="Send the GREMLIN to give a target ally a closer view of enemies on the battlefield, granting them +<Ability:KILLCAMRS_CRITBONUS/> Critical Chance and +<Ability:KILLCAMRS_DODGEBONUS/> Dodge."
LocFlyOverText="Kill Cam"
LocPromotionPopupText="<Bullet/> Kill Cam grants +<Ability:KILLCAMRS_CRITBONUS/> Critical Chance and +<Ability:KILLCAMRS_DODGEBONUS/> Dodge..<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/>"

[LacerateRS X2AbilityTemplate]
LocFriendlyName="Lacerate"
LocLongDescription="Move & Deliver a Critical Slash against a target."
LocHelpText="Move & Deliver a Critical Slash against a target."
LocFlyOverText="Lacerate"
LocPromotionPopupText="<Bullet/> Has a <Ability:LACERATERS_CRITBONUS/>% Crit Chance.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[LifeSaverRS X2AbilityTemplate]
LocFriendlyName="Life Saver"
LocLongDescription="Quickly restore a small amount of health to a nearby ally and cure them of any environmental ailments."
LocHelpText="Quickly restore a small amount of health to a nearby ally and cure them of any environmental ailments."
LocFlyOverText="Life Saver"
LocPromotionPopupText="<Bullet/> Restores 4 Health but this increases to 6 with Nanomedikits Tech.<br/><Bullet/> Must target an organic ally within 2 tiles of the user, cannot target self.<br/><Bullet/> Is a free action to use but has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Removes Effects such as Burning, Poison and Acid Burn.<br/>"

[LongReachRS X2AbilityTemplate]
LocFriendlyName="Long Reach"
LocLongDescription="Confers Squadsight & Long Watch."
LocHelpText="Confers Squadsight & Long Watch."
LocFlyOverText="Long Reach"
LocPromotionPopupText="<Bullet/> Squadsight allows the soldier to take standard shots at enemies within squad range as long as they have a clear line of sight.<br/><Bullet/> Long Watch allows the soldier to take reaction shots at enemies within squad range as long as they have clear line of sight.<br/>"

[MakeItCountRS X2AbilityTemplate]
LocFriendlyName="Make It Count"
LocLongDescription="Grants +<Ability:MAKEITCOUNTRS_AIMBONUS/> Aim on Overwatch Shots."
LocHelpText="Grants +<Ability:MAKEITCOUNTRS_AIMBONUS/> Aim on Overwatch Shots."
LocFlyOverText="Make It Count"
LocPromotionPopupText="<Bullet/> Grants +<Ability:MAKEITCOUNTRS_AIMBONUS/> Aim when on Overwatch.<br/><Bullet/> This is a passive effect.<br/>"	

[MalaiseRS X2AbilityTemplate]
LocFriendlyName="Malaise"
LocLongDescription="Conjures a cloud of Poison and Misery at a target location."
LocHelpText="Conjures a cloud of Poison and Misery at a target location."
LocFlyOverText="Malaise"
LocPromotionPopupText="<Bullet/> Effects an area of 5 tiles by default and can be cast up to 25 tiles away.<br/><Bullet/> Deals no initial damage.<br/><Bullet/> Poisons and Disorients targets within the area of effect. (That can be Poisoned and/or Disoriented)<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[MarkTargetRS X2AbilityTemplate]
LocFriendlyName="Mark Target"
LocLongDescription="Marks an enemy target, graning allies +<Ability:MARKTARGETRS_HIT/> Aim Chance against them."
LocHelpText="Marks an enemy target, graning allies +<Ability:MARKTARGETRS_HIT/> Aim Chance against them."
LocFlyOverText="Mark Target"
LocPromotionPopupText="<Bullet/> An enemy can only be marked by one 'mark' effect at a time.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"	

[MercilessRS X2AbilityTemplate]
LocFriendlyName="Merciless"
LocLongDescription="Grants +<Ability:MERCILESSRS_DMG/> damage and +<Ability:MERCILESSRS_CRIT/> critical chance on all Melee Attacks."
LocHelpText="Grants +<Ability:MERCILESSRS_DMG/> damage and +<Ability:MERCILESSRS_CRIT/> critical chance on all Melee Attacks."
LocFlyOverText="Merciless"
LocPromotionPopupText="<Bullet/> Grants +<Ability:MERCILESSRS_DMG/> damage and +<Ability:MERCILESSRS_CRIT/> critical chance on all Melee Attacks.<br/><Bullet/> This is a passive effect.<br/>"

[MiseryRS X2AbilityTemplate]
LocFriendlyName="Misery"
LocLongDescription="Confers Malaise & Soul Steal."
LocHelpText="Confers Malaise & Soul Steal."
LocFlyOverText="Misery"
LocPromotionPopupText="<Bullet/> Malaise allows the creation of a cloud of posion and misery at a target location.<br/><Bullet/> Soul Steal is a passive effect that allows soulfire to drain health from enemies.<br/>"

[MuteRS X2AbilityTemplate]
LocFriendlyName="Mute"
LocLongDescription="Grants <Ability:MUTERS_CHARGES/> additional charges of Stillness per mission."
LocHelpText="Grants <Ability:MUTERS_CHARGES/> additional charges of Stillness per mission."
LocFlyOverText="Mute"
LocPromotionPopupText="<Bullet/> Allows the user to recover from breaking concealment more easily.<br/><Bullet/> This is a passive effect.<br/>"

[OverchargeRS X2AbilityTemplate]
LocFriendlyName="Overcharge"
LocLongDescription="Increases the charges of all the GREMLIN abilities that have charges by +<Ability:OVERCHARGERS_CHARGES/>."
LocHelpText="Increases the charges of all the GREMLIN abilities that have charges by +<Ability:OVERCHARGERS_CHARGES/>."
LocFlyOverText="Overcharge"
LocPromotionPopupText="<Bullet/> Provides +<Ability:OVERCHARGERS_CHARGES/> Charges to:<br/><Bullet/> Action Protocol.<br/><Bullet/> Burn Protocol.<br/><Bullet/> Capacitor Discharge.<br/><Bullet/> Combat Protocol.<br/><Bullet/> Repair Protocol.<br/><Bullet/> Scanning Protocol.<br/><Bullet/> Shock Protocol.<br/><Bullet/> This is a passive effect.<br/>"	

[OverdriveRS X2AbilityTemplate]
LocFriendlyName="Overdrive"
LocLongDescription="Forces the soldier to push on, graning them an additional Action Point."
LocHelpText="Forces the soldier to push on, graning them an additional Action Point."
LocFlyOverText="Overdrive"
LocPromotionPopupText="<Bullet/> This action point can be used for anything but when moving with more than 2 action points it's best to take blue moves.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"	

[ParamedicRS X2AbilityTemplate]
LocFriendlyName="Paramedic"
LocLongDescription="Equipped medikits gain <Ability:PARAMEDICRS_MEDIKITCHARGES/> extra charges."
LocHelpText="Equipped medikits gain <Ability:PARAMEDICRS_MEDIKITCHARGES/> extra charges."
LocFlyOverText="Paramedic"
LocPromotionPopupText="<Bullet/> Equipped medikits gain <Ability:PARAMEDICRS_MEDIKITCHARGES/> extra charges.<br/><Bullet/> This is a passive effect.<br/>"	

[PotShotRS X2AbilityTemplate]
LocFriendlyName="Pot Shot"
LocLongDescription="A free shot with your Pistol that deals extra damage but carries a <Ability:POTSHOTRS_AIM_PENALTY/> Aim Penalty."
LocHelpText="A free shot with your Pistol that deals extra damage but carries a <Ability:POTSHOTRS_AIM_PENALTY/> Aim Penalty."
LocFlyOverText="Pot Shot"
LocPromotionPopupText="<Bullet/>The shot carries a <Ability:POTSHOTRS_AIM_PENALTY/> Aim Penalty.<br/><Bullet/> Deals double damage.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[ProtectorRS X2AbilityTemplate]
LocFriendlyName="Protector"
LocLongDescription="Confers Stasis & Stasis Shield."
LocHelpText="Confers Stasis & Stasis Shield."
LocFlyOverText="Protector"
LocPromotionPopupText="<Bullet/> Allows the user to cast stasis on enemies and allies which protects them from taking damage but makes them unable to act for 1 turn.<br/>"

[PsiReanimateRS X2AbilityTemplate]
LocFriendlyName="Psi-Reanimate"
LocLongDescription="Reanimate the corpse of a fallen humanoid target into a Zombie under your control."
LocHelpText="Reanimate the corpse of a fallen humanoid target into a Zombie under your control."
LocFlyOverText="Psi-Reanimate"
LocPromotionPopupText="<Bullet/> Psi-Zombies cannot be dismissed or evac from combat.<br/><Bullet/> Psi-Zombies persist if the user dies and also count as 'Soldiers Killed' on mission ratings.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[PuglistRS X2AbilityTemplate]
LocFriendlyName="Puglist"
LocLongDescription="Grants +<Ability:PUGLISTRS_DMGBONUS/> Damage and +<Ability:PUGLISTRS_AIMBONUS/> Aim on melee attacks."
LocHelpText="Grants +<Ability:PUGLISTRS_DMGBONUS/> Damage and +<Ability:PUGLISTRS_AIMBONUS/> Aim on melee attacks."
LocFlyOverText="Puglist"
LocPromotionPopupText="<Bullet/> This upgrades the Strike ability, allowing it to deal slightly more damage and be slightly more accurate.<br/><Bullet/> This is a passive effect.<br/>"

[PunisherRS X2AbilityTemplate]
LocFriendlyName="Punisher"
LocLongDescription="Allows melee attacks to deal critical damage."
LocHelpText="Allows melee attacks to deal critical damage."
LocFlyOverText="Punisher"
LocPromotionPopupText="<Bullet/> Grants +<Ability:PUNISHERRS_CRITBONUS/>% crit chance on Strike attacks.<br/><Bullet/> This is a passive effect.<br/>"

[RepairProtocolRS X2AbilityTemplate]
LocFriendlyName="Repair Protocol"
LocLongDescription="Send the GREMLIN to Repair a robotic ally, restoring <Ability:REPAIRPROTOCOLRS_AMOUNTREPAIRED/> hit points."
LocHelpText="Send the GREMLIN to Repair a robotic ally, restoring <Ability:REPAIRPROTOCOLRS_AMOUNTREPAIRED/> hit points."
LocFlyOverText="Repair Protocol"
LocPromotionPopupText="<Bullet/> Can be used to repair robotic allies such as SPARKS and Hacked MEC units.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Repair Protocol has <Ability:REPAIRPROTOCOLRS_CHARGES/> Charges per Mission.<br/>"

[RestoreRS X2AbilityTemplate]
LocFriendlyName="Restore"
LocLongDescription="Heals a target ally for <Ability:RESTORERS_HEAL/> Hit Points and fully Restores their condition."
LocHelpText="Heals a target ally for <Ability:RESTORERS_HEAL/> Hit Points and fully Restores their condition."
LocFlyOverText="Restore"
LocPromotionPopupText="<Bullet/> Heals <Ability:RESTORERS_HEAL/> Hit Points.<br/><Bullet/> Removes Effects such as Panicked, Disoriented, Stunned, Unconscious, Burning, Poison and Acid Burn.<br/><Bullet/> Restores both action points to the unit.<br/><Bullet/> Can be used on self or any target ally still alive in battle.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[RevitalizeRS X2AbilityTemplate]
LocFriendlyName="Revitalize"
LocLongDescription="Restore <Ability:REVITALIZERS_ACTIONPOINTSRESTORED/> Action Points to nearby allies."
LocHelpText="Restore <Ability:REVITALIZERS_ACTIONPOINTSRESTORED/> Action Points to nearby allies."
LocFlyOverText="Revitalize"
LocPromotionPopupText="<Bullet/> Allies must be within a close distance to revitalized.<br/><Bullet/> Has <Ability:REVITALIZERS_CHARGES/> uses per mission.<br/>"

[ReviveRS X2AbilityTemplate]
LocFriendlyName="Revive"
LocLongDescription="Cleanse an ally of any negative mental effects or revive them from an Unconscious state."
LocHelpText="Cleanse an ally of any negative mental effects or revive them from an Unconscious state."
LocFlyOverText="Revive"
LocPromotionPopupText="<Bullet/> Must target an organic ally within 2 tiles of the user, cannot target self.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Removes Effects such as Panicked, Disoriented, Stunned and Unconscious.<br/>"

[RushRS X2AbilityTemplate]
LocFriendlyName="Rush!"
LocLongDescription="Dash up to an enemy to attack them close range with your sidearm, then take advantage of the confusion and take another action."
LocHelpText="Dash up to an enemy to attack them close range with your sidearm, then take advantage of the confusion and take another action."
LocFlyOverText="Rush!"
LocPromotionPopupText="<Bullet/> Is a free action to use.<br/><Bullet/> Replaces the Charge! ability.<br/>"

[SapperRS X2AbilityTemplate]
LocFriendlyName="Sapper"
LocLongDescription="Your grenades deal +<Ability:SAPPERRS_DMGBONUS/> damage."
LocHelpText="Your grenades deal +<Ability:SAPPERRS_DMGBONUS/> damage."
LocFlyOverText="Sapper"
LocPromotionPopupText="<Bullet/> Anything fired from the Grenade Launcher will deal +<Ability:SAPPERRS_DMGBONUS/> damage.<br/><Bullet/> This is a passive effect.<br/>"

[ScanningProtocolRS X2AbilityTemplate]
LocFriendlyName="Scanning Protocol"
LocLongDescription="The GREMLIN can trigger an instant scan of the area, increasing the Specialist's sight radius substantially for one turn, and revealing any hidden or disguised enemies in view."
LocHelpText="Trigger a GREMLIN scan of the area, increasing the your sight radius substantially for one turn, and revealing any hidden or disguised enemies in view."
LocFlyOverText="Scanning Protocol"
LocPromotionPopupText="<Bullet/> Scanning Protocol has <Ability:SCANNINGPROTOCOLRS_CHARGES/> charges per mission.<br/><Bullet/> In addition to hidden and disguised enemies, enemies blocked from line of sight by walls or obstructions will also be revealed by Scanning Protocol.<br/>"

[SeekandDestroyRS X2AbilityTemplate]
LocFriendlyName="Seek and Destroy"
LocLongDescription="Gives a <Ability:SEEKANDDESTROYRS_CHANCE/>% chance to take a free reaction shot at newly revealed enemies when not concealed."
LocHelpText="Gives a <Ability:SEEKANDDESTROYRS_CHANCE/>% chance to take a free reaction shot at newly revealed enemies when not concealed."
LocFlyOverText="Seek and Destroy"
LocPromotionPopupText="<Bullet/> This effect can only be triggered on newly revealed enemies and can only proc once per enemy.<br/><Bullet/> This is a passive effect.<br/>"

[ShadeProtocolRS X2AbilityTemplate]
LocFriendlyName="Shade Protocol"
LocLongDescription="Send the GREMLIN to distort enemy fire on a target ally, granting them +<Ability:SHADEPROTOCOLRS_MOBILITYBONUS/> Mobility and Shadowstep."
LocHelpText="Send the GREMLIN to shroud a target ally from enemy view, granting them +<Ability:SHADEPROTOCOLRS_MOBILITYBONUS/> Mobility and Shadowstep."
LocFlyOverText="Shade Protocol"
LocPromotionPopupText="<Bullet/> The effects of Shade Protocol last for the duration of your turn.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[ShadowShotRS X2AbilityTemplate]
LocFriendlyName="Shadow Shot"
LocLongDescription="A shot from concealment with your Pistol that if it kills an enemy you will not be revealed."
LocHelpText="A shot from concealment with your Pistol that if it kills an enemy you will not be revealed."
LocFlyOverText="Shadow Shot"
LocPromotionPopupText="<Bullet/> While you won't be revealed, enemies may still scamper.<br/><Bullet/> Has a +<Ability:SHADOWSHOTRS_AIM_BONUS/> Aim and +<Ability:SHADOWSHOTRS_CRIT_BONUS/> Critical Chance Bonus.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[ShockProtocolRS X2AbilityTemplate]
LocFriendlyName="Shock Protocol"
LocLongDescription="Send the GREMLIN to shock a target enemy, stunning them for <Ability:SHOCKPROTOCOLRS_STUNDURATION/> turns."
LocHelpText="Send the GREMLIN to shock a target enemy, stunning them for <Ability:SHOCKPROTOCOLRS_STUNDURATION/> turns."
LocFlyOverText="Shock Protocol"
LocPromotionPopupText="<Bullet/> Can be used on organic and robotic targets.<br/><Bullet/> Shock Protocol has <Ability:SHOCKPROTOCOLRS_CHARGES/> Charges per Mission.<br/>"

[ShredderBlastRS X2AbilityTemplate]
LocFriendlyName="Shredder Blast"
LocLongDescription="A wide <Ability:WEAPONNAME/> shot that damages cover and enemies."
LocHelpText="A wide <Ability:WEAPONNAME/> shot that damages cover and enemies."
LocFlyOverText="Shredder Blast"
LocPromotionPopupText="<Bullet/> Can be shot at enemies in a wide cone area.<br/><Bullet/> Environmental damage is based on weapon tech level.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[SidearmSpecialistRS X2AbilityTemplate]
LocFriendlyName="Sidearm Specialist"
LocLongDescription="Grants +<Ability:SIDEARMSPECIALISTRS_DMGBONUS/> damage with secondary weapon attacks. Sword attacks also gain +<Ability:SIDEARMSPECIALISTRS_AIMBONUS/> aim along with any charge attacks."
LocHelpText="Grants +<Ability:SIDEARMSPECIALISTRS_DMGBONUS/> damage with secondary weapon attacks. Sword attacks also gain +<Ability:SIDEARMSPECIALISTRS_AIMBONUS/> aim along with any charge attacks."
LocFlyOverText="Sidearm Specialist"
LocPromotionPopupText="<Bullet/> Benefits damage of secondary weapons by +<Ability:SIDEARMSPECIALISTRS_DMGBONUS/>.<br/><Bullet/> Benefits the aim of certain attacks like Slash.<br/><Bullet/> This is a passive effect.<br/>"

[SilenceRS X2AbilityTemplate]
LocFriendlyName="Silence"
LocLongDescription="A shot that doesn't break concealment."
LocHelpText="A shot that doesn't break concealment."
LocFlyOverText="Silence"
LocPromotionPopupText="<Bullet/> Requires both actions to fire.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[Slash_RS X2AbilityTemplate]
LocFriendlyName="Slice"
LocLongDescription="Attack an adjacent target with your sword. Uses one action."
LocHelpText="Attack an adjacent target with your sword. Uses one action."
LocFlyOverText="Slice"
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your sword.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible.<br/>"

[SlashAndDashRS X2AbilityTemplate]
LocFriendlyName="Run And Slice"
LocLongDescription="Move & Slice a target. Uses one action."
LocHelpText="Move & Slice a target. Uses one action."
LocFlyOverText="Run And Slice"
LocPromotionPopupText="<Bullet/> Can only be used once per turn.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so additional attacks or movement are possible.<br/><Bullet/> Distance travelled will effect the distance left to perform a slash attack.<br/><Bullet/> Replaces the Slice ability.<br/>"

[SnapShotRS X2AbilityTemplate]
LocFriendlyName="Snapshot"
LocLongDescription="Take a shot after moving with the Sniper Rifle."
LocHelpText="Take a shot after moving with the Sniper Rifle."
LocFlyOverText="Snapshot"
LocPromotionPopupText="<Bullet/> Allows the operation of Sniper Rifles for a single action point.<br/><Bullet/> Has a <Ability:SNAPSHOTRS_PENALTY_AIM/> Aim and <Ability:SNAPSHOTRS_PENALTY_CRIT/> Critical Chance Penalty.<br/>"

[StabilizeRS X2AbilityTemplate]
LocFriendlyName="Stabilize"
LocLongDescription="Stop a soldier from bleeding out."
LocHelpText="Stop a soldier from bleeding out."
LocFlyOverText="Stabilized"
LocPromotionPopupText="<Bullet/> Must target an organic ally within 2 tiles of the user, cannot target self.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Prevents a soldier from bleeding out, making them Unconscious instead.<br/>"

[StickAndMoveRS X2AbilityTemplate]
LocFriendlyName="Stick and Move"
LocLongDescription="Grants +<Ability:STICKANDMOVERS_DEFENSE/> Defense and +<Ability:STICKANDMOVERS_MOBILITY/> Mobility."
LocHelpText="Grants +<Ability:STICKANDMOVERS_DEFENSE/> Defense and +<Ability:STICKANDMOVERS_MOBILITY/> Mobility."
LocFlyOverText="Stick and Move"
LocPromotionPopupText="<Bullet/> Grants +<Ability:STICKANDMOVERS_DEFENSE/> Defense and +<Ability:STICKANDMOVERS_MOBILITY/> Mobility.<br/><Bullet/> This is a passive effect.<br/>"

[StillnessRS X2AbilityTemplate]
LocFriendlyName="Stillness"
LocLongDescription="A special state that allows this soldier to stay in concealment when the squad is revealed and better evade enemy detection."
LocHelpText="A special state that allows this soldier to stay in concealment when the squad is revealed and better evade enemy detection."
LocFlyOverText="Stillness"
LocPromotionPopupText="<Bullet/> This soldier won't break concealment when the squad is revealed and will be concealed on missions when the rest of the squad isn't.<br/><Bullet/> The soldier is also harder to detect while concealed with a -80% Detection Radius.<br/><Bullet/> The soldier can return to stillness <Ability:STILLNESSRS_CHARGES/> times per mission when in cover and not flanked or when not in an enemies line of sight.<br/><Bullet/> This is a passive effect.<br/>"

[StillnessRSCharges X2AbilityTemplate]
LocFriendlyName="Stillness"
LocLongDescription="Allows the soldier to re-enter concealment at any time."
LocHelpText="Allows the soldier to re-enter concealment at any time."

[StormPositionRS X2AbilityTemplate]
LocFriendlyName="Storm Position"
LocLongDescription="Assault an enemy position and shoot them close range with your <Ability:WEAPONNAME/>."
LocHelpText="Assault an enemy position and shoot them close range with your <Ability:WEAPONNAME/>."
LocFlyOverText="Storm Position"
LocPromotionPopupText="<Bullet/> Allows for a dash then <Ability:WEAPONNAME/> attack at close range.<br/><Bullet/> Provides an aim and crit bonus to compensate for cover and flank bonuses.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[SurpriseShotRS X2AbilityTemplate]
LocFriendlyName="Surprise Shot"
LocLongDescription="A special Pistol shot that stuns an enemy for <Ability:SURPRISESHOTRS_STUN_TURNS/> turns. If the shot kills an enemy while you are concealed you will not be revealed."
LocHelpText="A special Pistol shot that stuns an enemy for <Ability:SURPRISESHOTRS_STUN_TURNS/> turns. If the shot kills an enemy while you are concealed you will not be revealed."
LocFlyOverText="Surprise Shot"
LocPromotionPopupText="<Bullet/> If the shot kills an enemy while you are concealed you will not be revealed.<br/><Bullet/> While you may not be revealed, enemies may still scamper.<br/><Bullet/> Has a +<Ability:SURPRISESHOTRS_AIM_BONUS/> Aim and +<Ability:SURPRISESHOTRS_CRIT_BONUS/> Critical Chance Bonus.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[SWATShieldRS X2AbilityTemplate]
LocFriendlyName="Personal Shield"
LocLongDescription="Activate a Personal Energy Shield around yourself that can mitigate a small amount of damage."
LocHelpText="Activate a Personal Energy Shield around yourself that can mitigate a small amount of damage."
LocFlyOverText="Personal Shield"
LocPromotionPopupText="<Bullet/> Personal Shield confers <Ability:SWATSHIELDRS_SHIELDPOINTS/> Shield Points to the user.<br/><Bullet/> Personal Shield lasts <Ability:SWATSHIELDRS_DURATION/> turns.<br/><Bullet/> Is a free action to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[SWATStrikeRS X2AbilityTemplate]
LocFriendlyName="Strike"
LocLongDescription="Dash up to a target and Strike them with your <Ability:WEAPONNAME/>."
LocHelpText="Dash up to a target and Strike them with your <Ability:WEAPONNAME/>."
LocFlyOverText="Strike"
LocPromotionPopupText="<Bullet/> Strike deals 1 to 3 damage by default.<br/><Bullet/> Can be effective at cleaning up weak or injured enemies.<br/><Bullet/> Can not be used on Robotic enemies.<br/><Bullet/> Can be imrpoved by perks such as Puglist and Punisher.<br/>"

[SWATTakedownRS X2AbilityTemplate]
LocFriendlyName="Takedown"
LocLongDescription="Dash up to a target and attempt a Takedown with your <Ability:WEAPONNAME/> for a chance to stun them."
LocHelpText="Dash up to a target and attempt a Takedown with your <Ability:WEAPONNAME/> for a chance to stun them."
LocFlyOverText="Takedown"
LocPromotionPopupText="<Bullet/> Takedown deals 2 to 4 damage by default.<br/><Bullet/> Has a <Ability:SWATTAKEDOWNRS_STUNCHANCE/>% chance to Stun an enemy for <Ability:SWATTAKEDOWNRS_STUNDURATION/> turns.<br/><Bullet/> Can be effective at cleaning up weak or injured enemies.<br/><Bullet/> Can not be used on Robotic enemies.<br/><Bullet/> Can be imrpoved by perks such as Puglist and Punisher.<br/><Bullet/> Replaces the Strike ability.<br/>"

[TeleportRS X2AbilityTemplate]
LocFriendlyName="Teleport"
LocLongDescription="Teleport to another location within squadsight."
LocHelpText="Teleport to another location within squadsight."
LocFlyOverText="Teleport"
LocPromotionPopupText="<Bullet/> Is a free action to use.<br/><Bullet/> Can be used once per turn.<br/>"

[TendWoundedRS X2AbilityTemplate]
LocFriendlyName="Tend Wounded"
LocLongDescription="Restore a small amount of health to nearby allies and cure them of any environmental ailments."
LocHelpText="Restore a small amount of health to nearby allies and cure them of any environmental ailments."
LocFlyOverText="Tend Wounded"
LocPromotionPopupText="<Bullet/> Restores 4 Health but this increases to 6 with Nanomedikits Tech.<br/><Bullet/> Only effects organic allies within 2 tiles of the user, will also affect the user.<br/><Bullet/> Requires a single action to use and does not end your turn.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/><Bullet/> Removes Effects such as Burning, Poison and Acid Burn.<br/>"

[VanishRS X2AbilityTemplate]
LocFriendlyName="Vanish"
LocLongDescription="Sacrifice a charge of Stillness to appear anywhere within squadsight."
LocHelpText="Sacrifice a charge of Stillness to appear anywhere within squadsight."
LocFlyOverText="Vanish"
LocPromotionPopupText="<Bullet/> Costs 1 charge of Stillness to use.<br/><Bullet/> Ends the soldiers turn so is best used as the last action.<br/><Bullet/> Doesn't break concealment.<br/><Bullet/> Doesn't grant concealment.<br/>"

[VoidmasterRS X2AbilityTemplate]
LocFriendlyName="Voidmaster"
LocLongDescription="Confers Void Rift & Schism."
LocHelpText="Confers Void Rift & Schism."
LocFlyOverText="Voidmaster"
LocPromotionPopupText="<Bullet/> Allows the casting of Void Rift to create a rift of psionic energy that damages enemies within and has a chance to make them suffer insanity.<br/><Bullet/> In addition Schism allows Insanity to deal a small amount of damage and rupture the target.<br/>"

[WalkFireRS X2AbilityTemplate]
LocFriendlyName="Walk Fire"
LocLongDescription="A <Ability:WEAPONNAME/> shot that is easier to hit with but has less chance to crit."
LocHelpText="A <Ability:WEAPONNAME/> shot that is easier to hit with but has less chance to crit."
LocFlyOverText="Walk Fire"
LocPromotionPopupText="<Bullet/> Has a +<Ability:WALKFIRERS_AIM/> Aim Bonus.<br/><Bullet/> Has a <Ability:WALKFIRERS_CRIT/> Crit Penalty.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"	

[WarningShotRS X2AbilityTemplate]
LocFriendlyName="Warning Shot"
LocLongDescription="A <Ability:WEAPONNAME/> shot that doesn't deal any damage but causes a target to panic."
LocHelpText="A <Ability:WEAPONNAME/> shot that doesn't deal any damage but causes a target to panic."
LocFlyOverText="Warning Shot"
LocPromotionPopupText="<Bullet/> The chance to Panic is based on the aim chance of the shot.<br/><Bullet/> Has a +<Ability:WARNINGSHOTRS_AIMBONUS/> Aim Bonus.<br/><Bullet/> Costs <Ability:SELFAMMOCOST/> ammo to use.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[WeaponExpertRS X2AbilityTemplate]
LocFriendlyName="Weapon Expert"
LocLongDescription="Deal +<Ability:WEAPONEXPERTRS_DMGBONUS/> damage with primary weapons."
LocHelpText="Deal +<Ability:WEAPONEXPERTRS_DMGBONUS/> damage with primary weapons."
LocFlyOverText="Weapon Expert"
LocPromotionPopupText="<Bullet/> Deal +<Ability:WEAPONEXPERTRS_DMGBONUS/> damage with primary weapon attacks and abilities.<br/><Bullet/> This is a passive effect.<br/>"

[WeaponSpecialistRS X2AbilityTemplate]
LocFriendlyName="Weapon Specialist"
LocLongDescription="Deal +<Ability:WEAPONSPECIALISTRS_DMGBONUS/> damage with primary weapons."
LocHelpText="Deal +<Ability:WEAPONSPECIALISTRS_DMGBONUS/> damage with primary weapons."
LocFlyOverText="Weapon Specialist"
LocPromotionPopupText="<Bullet/>Deal +<Ability:WEAPONSPECIALISTRS_DMGBONUS/> damage with primary weapon attacks and abilities.<br/><Bullet/> This is a passive effect.<br/>"

[WoundingShotRS X2AbilityTemplate]
LocFriendlyName="Wounding Shot"
LocLongDescription="A pistol shot that ruptures a target, making them take +<Ability:WOUNDINGSHOTRS_RUPTURE/> damage from all future attacks."
LocHelpText="A special shot with your Pistol that ruptures a target, making them take +<Ability:WOUNDINGSHOTRS_RUPTURE/> damage from all future attacks."
LocFlyOverText="Wounding Shot"
LocPromotionPopupText="<Bullet/> Ruptured targets will take more damage from additional attacks so it's best to use a rupture effect attack first.<br/><Bullet/> Has a <Ability:SELFCOOLDOWN/> turn cooldown.<br/>"

[ZeroInRS X2AbilityTemplate]
LocFriendlyName="Zero In!"
LocLongDescription="Focus and dash up to an enemy to attack them close range with your sidearm."
LocHelpText="Focus and dash up to an enemy to attack them close range with your sidearm."
LocFlyOverText="Zero In!"
LocPromotionPopupText="<Bullet/> Has +<Ability:ZEROINRS_AIM/> Aim Chance.<br/><Bullet/> Replaces the Charge! ability.<br/>"


;************************************************************************************************************
;GTS Perks (A-Z by Class)
;************************************************************************************************************

;Assassin

[AssassinPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Assassin: Shadow Fire"
Summary="Trains our Assassins to be able to take out enemies from a distance without being revealed. Grants the Shadow Fire ability for use with the Sniper Rifle."

[ShadowFireRS X2AbilityTemplate]
LocFriendlyName="Shadow Fire"
LocLongDescription="A special shot with your <Ability:WEAPONNAME/> that if it kills an enemy while you are concealed you will not be revealed."
LocHelpText="A special shot with your <Ability:WEAPONNAME/> that if it kills an enemy while you are concealed you will not be revealed."
LocFlyOverText="Shadow Fire"
LocPromotionPopupText="<Bullet/> A special shot with your <Ability:WEAPONNAME/> that if it kills an enemy while you are concealed you will not be revealed.<br/>"

[ShadowFireNonSniperRS X2AbilityTemplate]
LocFriendlyName="Shadow Fire"
LocLongDescription="A special shot with your <Ability:WEAPONNAME/> that if it kills an enemy while you are concealed you will not be revealed."
LocHelpText="A special shot with your <Ability:WEAPONNAME/> that if it kills an enemy while you are concealed you will not be revealed."
LocFlyOverText="Shadow Fire"
LocPromotionPopupText="<Bullet/> If the shot kills an enemy while you are concealed you will not be revealed.<br/><Bullet/> While you may not be revealed, enemies may still scamper.<br/><Bullet/> Replaces Standard Shot.<br/>"

;Demolitions

[DemolitionsPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Demolitions: Biggest Booms"
Summary="Trains our Demolitions so that when they deploy grenades they target enemy weak points, allowing them a chance to deal critical damage."

;Gunner

[GunnerPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Gunner: Iron Resolve"
Summary="Trains our Gunners to be more durable in combat. Grants +<Ability:IRONRESOLVERS_DEFENSE/> Defense and +<Ability:IRONRESOLVERS_WILL/> Willpower."

[IronResolveRS X2AbilityTemplate]
LocFriendlyName="Iron Resolve"
LocLongDescription="Grants +<Ability:IRONRESOLVERS_DEFENSE/> Defense and +<Ability:IRONRESOLVERS_WILL/> Willpower."
LocHelpText="Grants +<Ability:IRONRESOLVERS_DEFENSE/> Defense and +<Ability:IRONRESOLVERS_WILL/> Willpower."
LocFlyOverText="Iron Resolve"
LocPromotionPopupText="<Bullet/>Grants +<Ability:IRONRESOLVERS_DEFENSE/> Defense and +<Ability:IRONRESOLVERS_WILL/> Willpower.<br/>"	

;Mage

[MagePerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Mage: Hidden Potential"
Summary="Trains our Mages to unleash their Hidden Psionic Potential. Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense."

[HiddenPotentialRS X2AbilityTemplate]
LocFriendlyName="Hidden Potential"
LocLongDescription="Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense."
LocHelpText="Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense."
LocFlyOverText="Hidden Potential"
LocPromotionPopupText="<Bullet/>Grants +<Ability:HIDDENPOTENTIAL_PSIOFFENSE/> Psi Offense.<br/>"	

;Marksman

[MarksmanPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Marksman: Focused Fire"
Summary="Trains our Marksmen to be able to control their breathing to take more accurate and potentially more fatal shots at a enemies. Grants +<Ability:FOCUSEDFIRERS_AIM/> Aim & +<Ability:FOCUSEDFIRERS_CRIT/> Critical Chance."

[FocusedFireRS X2AbilityTemplate]
LocFriendlyName="Focused Fire"
LocLongDescription="Grants +<Ability:FOCUSEDFIRERS_AIM/> Aim & +<Ability:FOCUSEDFIRERS_CRIT/> Critical Chance."
LocHelpText="Grants +<Ability:FOCUSEDFIRERS_AIM/> Aim & +<Ability:FOCUSEDFIRERS_CRIT/> Critical Chance."
LocFlyOverText="Focused Fire"
LocPromotionPopupText="<Bullet/>Grants +<Ability:FOCUSEDFIRERS_AIM/> Aim & +<Ability:FOCUSEDFIRERS_CRIT/> Critical Chance.<br/>"	

;Medic

[MedicPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Medic: Combat Vigilance"
Summary="Trains our Medics to be cautious and aware at all times, allowing them to watch over the squad. Grants +<Ability:COMBATVIGILANCERS_AIM/> Aim, +<Ability:COMBATVIGILANCERS_CRIT/> Critical Chance, +<Ability:COMBATVIGILANCERS_WILL/> Willpower, +<Ability:COMBATVIGILANCERS_DODGE/> Dodge and +<Ability:COMBATIGILANCERS_DEFENSE/> Defense."

[CombatVigilanceRS X2AbilityTemplate]
LocFriendlyName="Combat Vigilance"
LocLongDescription="Grants +<Ability:COMBATVIGILANCERS_AIM/> Aim, +<Ability:COMBATVIGILANCERS_CRIT/> Critical Chance, +<Ability:COMBATVIGILANCERS_WILL/> Willpower, +<Ability:COMBATVIGILANCERS_DODGE/> Dodge and +<Ability:COMBATIGILANCERS_DEFENSE/> Defense."
LocHelpText="Grants +<Ability:COMBATVIGILANCERS_AIM/> Aim, +<Ability:COMBATVIGILANCERS_CRIT/> Critical Chance, +<Ability:COMBATVIGILANCERS_WILL/> Willpower, +<Ability:COMBATVIGILANCERS_DODGE/> Dodge and +<Ability:COMBATIGILANCERS_DEFENSE/> Defense."
LocFlyOverText="Combat Vigilance"
LocPromotionPopupText="<Bullet/>Grants +<Ability:COMBATVIGILANCERS_AIM/> Aim, +<Ability:COMBATVIGILANCERS_CRIT/> Critical Chance, +<Ability:COMBATVIGILANCERS_WILL/> Willpower, +<Ability:COMBATVIGILANCERS_DODGE/> Dodge and +<Ability:COMBATIGILANCERS_DEFENSE/> Defense.<br/>"	

;Raider

[RaiderPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Raider: Lethality"
Summary="Trains our Raiders to focus their aggression into hitting the enemy as hard as they can. Grants +<Ability:LETHALITYRS_CRIT/> Critical Chance."

[LethalityRS X2AbilityTemplate]
LocFriendlyName="Lethality"
LocLongDescription="Grants +<Ability:LETHALITYRS_CRIT/> Critical Chance."
LocHelpText="Grants +<Ability:LETHALITYRS_CRIT/> Critical Chance."
LocFlyOverText="Lethality"
LocPromotionPopupText="<Bullet/>Grants +<Ability:LETHALITYRS_CRIT/> Critical Chance.<br/>"	

;Rifleman

[RiflemanPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Rifleman: Shake It Off"
Summary="Trains our Riflemen to better condition themselves and try to shake off any damage they take. Grants +<Ability:SHAKEITOFFRS_DODGE/> Dodge."

[ShakeItOffRS X2AbilityTemplate]
LocFriendlyName="Shake It Off"
LocLongDescription="Grants +<Ability:SHAKEITOFFRS_DODGE/> Dodge."
LocHelpText="Grants +<Ability:SHAKEITOFFRS_DODGE/> Dodge."
LocFlyOverText="Shake It Off"
LocPromotionPopupText="<Bullet/>Grants +<Ability:SHAKEITOFFRS_DODGE/> Dodge.<br/>"	

;Scout

[ScoutPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Scout: Incognito"
Summary="Trains our Scouts to draw less attention to themselves in the field, allowing them to blend into the background better. Grants -30% Detection Radius from enemies while Concealed."

[IncognitoRS X2AbilityTemplate]
LocFriendlyName="Incognito"
LocLongDescription="Grants -30% Detection Radius from enemies while Concealed."
LocHelpText="Grants -30% Detection Radius from enemies while Concealed."
LocFlyOverText="Incognito"
LocPromotionPopupText="<Bullet/>Grants -30% Detection Radius from enemies while Concealed.<br/>"	

;Survivalist

[SurvivalistPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Survivalist: Conceal and Carry"
Summary="Trains our Survivalists to be able to stay in concealment when the squad is revealed. They will also harder to detect while concealed with a -40% Detection Radius."

;SWAT

[SWATPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="SWAT: Rapid Response"
Summary="Trains our SWAT soldiers to move in quicker on targets and be quicker on the trigger. Grants +<Ability:RAPIDRESPONSERS_MOBILITY/> Mobility and +<Ability:RAPIDRESPONSERS_CRIT/> Critical Chance."

[RapidResponseRS X2AbilityTemplate]
LocFriendlyName="Rapid Response"
LocLongDescription="Grants +<Ability:RAPIDRESPONSERS_MOBILITY/> Mobility and +<Ability:RAPIDRESPONSERS_CRIT/> Critical Chance."
LocHelpText="Grants +<Ability:RAPIDRESPONSERS_MOBILITY/> Mobility and +<Ability:RAPIDRESPONSERS_CRIT/> Critical Chance."
LocFlyOverText="Rapid Response"
LocPromotionPopupText="<Bullet/>Grants +<Ability:RAPIDRESPONSERS_MOBILITY/> Mobility and +<Ability:RAPIDRESPONSERS_CRIT/> Critical Chance.<br/>"	

;Technician

[TechnicianPerkGTS X2SoldierAbilityUnlockTemplate]
DisplayName="Technician: Overclock"
Summary="Trains our Technicians to Overclock their Gremlin units, allowing for more processing power. Grants +<Ability:OVERCLOCKRS_HACK/> Hack."

[OverclockRS X2AbilityTemplate]
LocFriendlyName="Overclock"
LocLongDescription="Grants +<Ability:OVERCLOCKRS_HACK/> Hack."
LocHelpText="Grants +<Ability:OVERCLOCKRS_HACK/> Hack."
LocFlyOverText="Overclock"
LocPromotionPopupText="<Bullet/>Grants +<Ability:OVERCLOCKRS_HACK/> Hack.<br/>"	


;************************************************************************************************************
;Class Names, Descriptions & Nicknames (A-Z by Class)
;************************************************************************************************************

[AssassinRS X2SoldierClassTemplate]
+DisplayName="Assassin"
+ClassSummary="Assassins are trained to dispatch single targets, be it up close or from afar. They use concealment to get up close to targets amd flank them from the shadows."
+LeftAbilityTreeTitle="Hunter"
+RightAbilityTreeTitle="Shinobi"
+AbilityTreeTitles[0]="Hunter"
+AbilityTreeTitles[1]="Shinobi"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="47"
+RandomNickNames[1]="Blade"
+RandomNickNames[2]="Butcher"
+RandomNickNames[3]="Deadeye"
+RandomNickNames[4]="Deadshot"
+RandomNickNames[5]="Deathstroke"
+RandomNickNames[6]="Dragon"
+RandomNickNames[7]="Ghost"
+RandomNickNames[8]="Hunter"
+RandomNickNames[9]="Judge"
+RandomNickNames[10]="Killer"
+RandomNickNames[11]="Longshot"
+RandomNickNames[12]="Nightmare"
+RandomNickNames[13]="Ninja"
+RandomNickNames[14]="Panther"
+RandomNickNames[15]="Reaper"
+RandomNickNames[16]="Reaver"
+RandomNickNames[17]="Scorpion"
+RandomNickNames[18]="Slayer"
+RandomNickNames[19]="Shadow"
+RandomNickNames[20]="Snake-Eyes"
+RandomNickNames[21]="Specter"
+RandomNickNames[22]="Spectre"
+RandomNickNames[23]="Stalker"
+RandomNickNames[24]="Talon"
+RandomNickNames[25]="Undertaker"
+RandomNickNames[26]="Wraith"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Chameleon"
+RandomNickNames_Male[1]="Demon"
+RandomNickNames_Male[2]="Edge"
+RandomNickNames_Male[3]="Ezio"
+RandomNickNames_Male[4]="Grim"
+RandomNickNames_Male[5]="Hitman"
+RandomNickNames_Male[6]="Ronin"
+RandomNickNames_Male[7]="Scythe"
+RandomNickNames_Male[8]="Venom"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Banshee"
+RandomNickNames_Female[1]="Dusk"
+RandomNickNames_Female[2]="Frost"
+RandomNickNames_Female[3]="Gloom"
+RandomNickNames_Female[4]="Hitgirl"
+RandomNickNames_Female[5]="Kunai"
+RandomNickNames_Female[6]="Mist"
+RandomNickNames_Female[7]="Shade"
+RandomNickNames_Female[8]="Widow"

[DemolitionsRS X2SoldierClassTemplate]
+DisplayName="Demolitions"
+ClassSummary="Demolition units are great at crowd control and assaulting enemy positions. They can deploy grenades at long distances, provide support fire and assault the enemy up close."
+LeftAbilityTreeTitle="Assaulter"
+RightAbilityTreeTitle="Grenadier"
+AbilityTreeTitles[0]="Assaulter"
+AbilityTreeTitles[1]="Grenadier"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="C4"
+RandomNickNames[1]="Claymore"
+RandomNickNames[2]="Crispy"
+RandomNickNames[3]="Fallout"
+RandomNickNames[4]="Firefly"
+RandomNickNames[5]="Firestarter"
+RandomNickNames[6]="Fireworks"
+RandomNickNames[7]="Flashbang"
+RandomNickNames[8]="Flatline"
+RandomNickNames[9]="Fragger"
+RandomNickNames[10]="Minefield"
+RandomNickNames[11]="Minesweeper"
+RandomNickNames[12]="Napalm"
+RandomNickNames[13]="Rocket"
+RandomNickNames[14]="Sapper"
+RandomNickNames[15]="Shrapnel"
+RandomNickNames[16]="Shredder"
+RandomNickNames[17]="Smoker"
+RandomNickNames[18]="Smokey"
+RandomNickNames[19]="Sweeper"
+RandomNickNames[20]="Tankbuster"
+RandomNickNames[21]="Teargas"
+RandomNickNames[22]="Toaster"
+RandomNickNames[23]="Toasty"
+RandomNickNames[24]="Tripwire"
+RandomNickNames[25]="Volatile"

[GunnerRS X2SoldierClassTemplate]
+DisplayName="Gunner"
+ClassSummary="Gunners are more durable than regular soldiers & provide heavy firepower wherever needed. They can suppress enemy targets, provide support fire & take multiple shots at the enemy."
+LeftAbilityTreeTitle="Juggernaut"
+RightAbilityTreeTitle="Sentry"
+AbilityTreeTitles[0]="Juggernaut"
+AbilityTreeTitles[1]="Sentry"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Badass"
+RandomNickNames[1]="Bazooka"
+RandomNickNames[2]="Berserker"
+RandomNickNames[3]="Brick"
+RandomNickNames[4]="Bulletswarm"
+RandomNickNames[5]="Cannon"
+RandomNickNames[6]="Carnage"
+RandomNickNames[7]="Commando"
+RandomNickNames[8]="Flak"
+RandomNickNames[9]="Gatling"
+RandomNickNames[10]="Grinder"
+RandomNickNames[11]="Hulk"
+RandomNickNames[12]="Jaeger"
+RandomNickNames[13]="Juggernaut"
+RandomNickNames[14]="Mayhem"
+RandomNickNames[15]="Mortar"
+RandomNickNames[16]="Paladin"
+RandomNickNames[17]="Powerhouse"
+RandomNickNames[18]="Roadblock"
+RandomNickNames[19]="Terminator"

[MageRS X2SoldierClassTemplate]
+DisplayName="Mage"
+ClassSummary="Only a very few gifted individuals can naturally develop their psionic potential. Those who are capable could prove to be valuable assets in our fight against the Elders. Only time will tell what these individuals are capable of in the field."
+LeftAbilityTreeTitle="Cleric"
+RightAbilityTreeTitle="Sorcerer"
+AbilityTreeTitles[0]="Cleric"
+AbilityTreeTitles[1]="Sorcerer"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Acolyte"
+RandomNickNames[1]="Dreameater"
+RandomNickNames[2]="Druid"
+RandomNickNames[3]="Haze"
+RandomNickNames[4]="Hex"
+RandomNickNames[5]="Magus"
+RandomNickNames[6]="Malaise"
+RandomNickNames[7]="Mystic"
+RandomNickNames[8]="Nightmare"
+RandomNickNames[9]="Shaman"
+RandomNickNames[10]="Souleater"
+RandomNickNames[11]="Voidwalker"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Wizard"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Nightshade"
+RandomNickNames_Female[1]="Tharja"
+RandomNickNames_Female[2]="Witch"

+RankNames[0]="Rookie"
+RankNames[1]="Initiate"
+RankNames[2]="Acolyte"
+RankNames[3]="Adept"
+RankNames[4]="Disciple"
+RankNames[5]="Mystic"
+RankNames[6]="Warlock"
+RankNames[7]="Magus"
+RankNames[8]="Master"

+ShortNames[0]="Rk."
+ShortNames[1]="Int."
+ShortNames[2]="Acl."
+ShortNames[3]="Adp."
+ShortNames[4]="Dsc."
+ShortNames[5]="Mys."
+ShortNames[6]="War."
+ShortNames[7]="Mag."

+RankIcons[0]= "UILibrary_Common.rank_rookie"
+RankIcons[1]= "UILibrary_Common.psirank_initiate"
+RankIcons[2]= "UILibrary_Common.psirank_acolyte"
+RankIcons[3]= "UILibrary_Common.psirank_adept"
+RankIcons[4]= "UILibrary_Common.psirank_disciple"
+RankIcons[5]= "UILibrary_Common.psirank_mystic"
+RankIcons[6]= "UILibrary_Common.psirank_warlock"
+RankIcons[7]= "UILibrary_Common.psirank_magus"

[MarksmanRS X2SoldierClassTemplate]
+DisplayName="Marksman"
+ClassSummary="Marksmen are skilled sharpshooter’s adept at long range shooting, Pistol shooting & single target dispatch. They can take out key targets from a distance, provide support fire & use the pistol to soften up targets."
+LeftAbilityTreeTitle="Sharpshooter"
+RightAbilityTreeTitle="Sentinel"
+AbilityTreeTitles[0]="Sharpshooter"
+AbilityTreeTitles[1]="Sentinel"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Bolts"
+RandomNickNames[1]="Chaser"
+RandomNickNames[2]="Clutch"
+RandomNickNames[3]="Defender"
+RandomNickNames[4]="Doubletap"
+RandomNickNames[5]="Dragoon"
+RandomNickNames[6]="Guardian"
+RandomNickNames[7]="Lance"
+RandomNickNames[8]="Lancer"
+RandomNickNames[9]="Oneshot"
+RandomNickNames[10]="Overseer"
+RandomNickNames[11]="Pierce"
+RandomNickNames[12]="Pinpoint"
+RandomNickNames[13]="Quickshot"
+RandomNickNames[14]="Ranger"
+RandomNickNames[15]="Sentinel"
+RandomNickNames[16]="Sentry"
+RandomNickNames[17]="Sharpshot"
+RandomNickNames[18]="Streaker"
+RandomNickNames[19]="Striker"
+RandomNickNames[20]="Stryker"
+RandomNickNames[21]="Tracer"
+RandomNickNames[22]="Tracker"
+RandomNickNames[23]="Trigger"
+RandomNickNames[24]="Vision"
+RandomNickNames[25]="Warden"

[MedicRS X2SoldierClassTemplate]
+DisplayName="Medic"
+ClassSummary="Medics can deploy advanced medical care with the use of Medikits and select training. They excel at watching over the squad & are essential to keeping allies alive."
+LeftAbilityTreeTitle="Healer"
+RightAbilityTreeTitle="Warden"
+AbilityTreeTitles[0]="Healer"
+AbilityTreeTitles[1]="Warden"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Angel"
+RandomNickNames[1]="Defender"
+RandomNickNames[2]="Doc"
+RandomNickNames[3]="Duck"
+RandomNickNames[4]="Flatline"
+RandomNickNames[5]="Guardian"
+RandomNickNames[6]="IV"
+RandomNickNames[7]="Monk"
+RandomNickNames[8]="Nails"
+RandomNickNames[9]="Necro"
+RandomNickNames[10]="OCD"
+RandomNickNames[11]="Patches"
+RandomNickNames[12]="Pox"
+RandomNickNames[13]="Strings"
+RandomNickNames[14]="Tick"
+RandomNickNames[15]="Tremor"
+RandomNickNames[16]="Triage"
+RandomNickNames[17]="Trips"
+RandomNickNames[18]="Warden"
+RandomNickNames[19]="Watcher"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Mercy"

[RaiderRS X2SoldierClassTemplate]
+DisplayName="Raider"
+ClassSummary="Raiders are highly aggressive soldiers who prefer to get up close to the enemy. They take a lot of risks but excel at flanking enemies and fighting in close quarters."
+LeftAbilityTreeTitle="Marauder"
+RightAbilityTreeTitle="Corsair"
+AbilityTreeTitles[0]="Marauder"
+AbilityTreeTitles[1]="Corsair"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Argonaut"
+RandomNickNames[1]="Berserker"
+RandomNickNames[2]="Berzerker"
+RandomNickNames[3]="Blitz"
+RandomNickNames[4]="Braveheart"
+RandomNickNames[5]="Highlander"
+RandomNickNames[6]="Marauder"
+RandomNickNames[7]="Nord"
+RandomNickNames[8]="Pirate"
+RandomNickNames[9]="Ravager"
+RandomNickNames[10]="Reaper"
+RandomNickNames[11]="Ronin"
+RandomNickNames[12]="Sparrow"
+RandomNickNames[13]="Strider"
+RandomNickNames[14]="Viking"
+RandomNickNames[15]="Warlord"
+RandomNickNames[16]="Warmonger"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Bull"
+RandomNickNames_Male[1]="Taurus"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Francisca"
+RandomNickNames_Female[1]="Valkyrie"

[RiflemanRS X2SoldierClassTemplate]
+DisplayName="Rifleman"
+ClassSummary="Riflemen serve a more conventional role in our squads & excel at outmanoeuvring the enemy. They can get around enemies to flank their positions & keep enemies engaged long enough to hinder their advance."
+LeftAbilityTreeTitle="Commando"
+RightAbilityTreeTitle="Infantry"
+AbilityTreeTitles[0]="Commando"
+AbilityTreeTitles[1]="Infantry"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Alpha"
+RandomNickNames[1]="Beanbag"
+RandomNickNames[2]="Blitz"
+RandomNickNames[3]="Bravo"
+RandomNickNames[4]="Charlie"
+RandomNickNames[5]="Clutch"
+RandomNickNames[6]="Delta"
+RandomNickNames[7]="Eagle-Eyes"
+RandomNickNames[8]="Echo"
+RandomNickNames[9]="Foxtrot"
+RandomNickNames[10]="Frontline"
+RandomNickNames[11]="Frosty"
+RandomNickNames[12]="Golf"
+RandomNickNames[13]="Grunt"
+RandomNickNames[14]="Gunner"
+RandomNickNames[15]="Hammer"
+RandomNickNames[16]="Hotel"
+RandomNickNames[17]="Kilo"
+RandomNickNames[18]="Last-Mag"
+RandomNickNames[19]="Lima"
+RandomNickNames[20]="Lookout"
+RandomNickNames[21]="Marksman"
+RandomNickNames[22]="November"
+RandomNickNames[23]="Pointman"
+RandomNickNames[24]="Quebec"
+RandomNickNames[25]="Roller"
+RandomNickNames[26]="Sierra"
+RandomNickNames[27]="Takedown"
+RandomNickNames[28]="Tango"
+RandomNickNames[29]="Tracer"
+RandomNickNames[30]="Uniform"
+RandomNickNames[31]="Warden"
+RandomNickNames[32]="Whiskey"
+RandomNickNames[33]="Yankee"
+RandomNickNames[34]="Zulu"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Mike"
+RandomNickNames_Male[1]="Oscar"
+RandomNickNames_Male[2]="Papa"
+RandomNickNames_Male[3]="Romeo"
+RandomNickNames_Male[4]="Victor"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="India"
+RandomNickNames_Female[1]="Julliet"

[ScoutRS X2SoldierClassTemplate]
+DisplayName="Scout"
+ClassSummary="Scouts are masters of subterfuge and provide reconnaissance to allies in the field. They can distract enemy troops, close in on objectives and engage targets up close with the pistol."
+LeftAbilityTreeTitle="Recon"
+RightAbilityTreeTitle="Gunslinger"
+AbilityTreeTitles[0]="Recon"
+AbilityTreeTitles[1]="Gunslinger"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Acrobat"
+RandomNickNames[1]="Angel"
+RandomNickNames[2]="Blackjack"
+RandomNickNames[3]="Bluebird"
+RandomNickNames[4]="Dragon"
+RandomNickNames[5]="Duchess"
+RandomNickNames[6]="Fox"
+RandomNickNames[7]="Halo"
+RandomNickNames[8]="Mantis"
+RandomNickNames[9]="Ocelot"
+RandomNickNames[10]="Oddjob"
+RandomNickNames[11]="Owl"
+RandomNickNames[12]="Panther"
+RandomNickNames[13]="Robin"
+RandomNickNames[14]="Smoke"
+RandomNickNames[15]="Snake"
+RandomNickNames[16]="Vertigo"
+RandomNickNames[17]="Viper"
+RandomNickNames[18]="Wolf"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Bulldog"
+RandomNickNames_Male[1]="Chicago"
+RandomNickNames_Male[2]="Eagle"
+RandomNickNames_Male[3]="Falcon"
+RandomNickNames_Male[4]="Hawk"
+RandomNickNames_Male[5]="Gryphon"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Amber"
+RandomNickNames_Female[1]="Bell"
+RandomNickNames_Female[2]="Crystal"
+RandomNickNames_Female[3]="Dagger"
+RandomNickNames_Female[4]="Rogue"
+RandomNickNames_Female[5]="Ruby"
+RandomNickNames_Female[6]="Sapphire"
+RandomNickNames_Female[7]="Scarlet"
+RandomNickNames_Female[8]="Widow"

[SurvivalistRS X2SoldierClassTemplate]
+DisplayName="Survivalist"
+ClassSummary="Survivalists can wield a range of weapons but don’t have a dedicated role in combat. They can be better trained as soldiers or rely on improvised tactics to take down enemies."
+LeftAbilityTreeTitle="Specialist"
+RightAbilityTreeTitle="Improviser"
+AbilityTreeTitles[0]="Specialist"
+AbilityTreeTitles[1]="Improviser"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Bug-Out"
+RandomNickNames[1]="Clutch"
+RandomNickNames[2]="Coyote"
+RandomNickNames[3]="Crash"
+RandomNickNames[4]="Crunch"
+RandomNickNames[5]="Fang"
+RandomNickNames[6]="Fangs"
+RandomNickNames[7]="Fugazi"
+RandomNickNames[8]="Geardo"
+RandomNickNames[9]="Gearhead"
+RandomNickNames[10]="Goblin"
+RandomNickNames[11]="Grunt"
+RandomNickNames[12]="Nomad"
+RandomNickNames[13]="Prepper"
+RandomNickNames[14]="Sabre"
+RandomNickNames[15]="Snake Eater"
+RandomNickNames[16]="Survivor"
+RandomNickNames[17]="Trickshot"
+RandomNickNames[18]="Wolf"
+RandomNickNames[19]="Wolverine"
+RandomNickNames[20]="Zed"
+RandomNickNames[21]="Zombie"

[SWATRS X2SoldierClassTemplate]
+DisplayName="SWAT"
+ClassSummary="SWATs specialize in mid to close range skirmishes & softening up enemy targets. They can assault enemy positions, provide support fire & distract enemies."
+LeftAbilityTreeTitle="Breacher"
+RightAbilityTreeTitle="Support"
+AbilityTreeTitles[0]="Breacher"
+AbilityTreeTitles[1]="Support"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Arbiter"
+RandomNickNames[1]="Bear"
+RandomNickNames[2]="Bishop"
+RandomNickNames[3]="Bloodhound"
+RandomNickNames[4]="Bulwark"
+RandomNickNames[5]="Delta"
+RandomNickNames[6]="Flash"
+RandomNickNames[7]="Goliath"
+RandomNickNames[8]="Grease"
+RandomNickNames[9]="Hardass"
+RandomNickNames[10]="Hardball"
+RandomNickNames[11]="Holdout"
+RandomNickNames[12]="Judge"
+RandomNickNames[13]="Knight"
+RandomNickNames[14]="Marshal"
+RandomNickNames[15]="Ranger"
+RandomNickNames[16]="Rhino"
+RandomNickNames[17]="Rook"
+RandomNickNames[18]="Smoke"
+RandomNickNames[19]="Shepherd"
+RandomNickNames[20]="Shield"
+RandomNickNames[21]="Tango"
+RandomNickNames[22]="Templar"
+RandomNickNames[23]="Titan"
+RandomNickNames[24]="Warden"

[TechnicianRS X2SoldierClassTemplate]
+DisplayName="Technician"
+ClassSummary="Technicians utilize the Gremlin to hack the advent network & retrieve sensitive data. They excel at assisting allies & disrupting enemies."
+LeftAbilityTreeTitle="Distorter"
+RightAbilityTreeTitle="Disrupter"
+AbilityTreeTitles[0]="Distorter"
+AbilityTreeTitles[1]="Disrupter"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Atlas"
+RandomNickNames[1]="Bitcoin"
+RandomNickNames[2]="Bluescreen"
+RandomNickNames[3]="Crasher"
+RandomNickNames[4]="Facetime"
+RandomNickNames[5]="Firefox"
+RandomNickNames[6]="Fixit"
+RandomNickNames[7]="Fuzz"
+RandomNickNames[8]="Gadget"
+RandomNickNames[9]="Gizmo"
+RandomNickNames[10]="Glitch"
+RandomNickNames[11]="Hackz"
+RandomNickNames[12]="Index"
+RandomNickNames[13]="Jockey"
+RandomNickNames[14]="Mechanic"
+RandomNickNames[15]="Napster"
+RandomNickNames[16]="Overload"
+RandomNickNames[17]="Sparks"
+RandomNickNames[18]="Sparky"
+RandomNickNames[19]="Static"
+RandomNickNames[20]="The Guru"
+RandomNickNames[21]="Torrent"
+RandomNickNames[22]="Trojan"
+RandomNickNames[23]="Wwwyzzerdd"


;************************************************************************************************************
;END FILE
;************************************************************************************************************